app/controllers/categories_controller.rb

  def create
    p params
    @category = Category.new params[:category]
    redirect_to categories_path if @category.save
---
INSERT INTO "categories" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 18 Nov 2013 22:50:41 UTC +00:00], ["title", nil], ["updated_at", Mon, 18 Nov 2013 22:50:41 UTC +00:00]]

  def show
    @category = Category.find params[:id]
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", "1"]]