app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "email", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "ocool"], ["created_at", Tue, 19 Nov 2013 01:00:13 UTC +00:00], ["email", "cool@cool.com"], ["name", "Cool"], ["price", "cool"], ["updated_at", Tue, 19 Nov 2013 01:00:13 UTC +00:00]]
---
  def create
    @post = Post.new params[:post]
    redirect_to post_path(@post.id) if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "5"]]
---
  def show
    @post = Post.find params[:id]